# `DSML_WS_03` - Introduction to Pandas

In this tutorial we will continue with our introduction series to key python data science libraries. Today we will focus on `Pandas`.

We will go through the following:

- **Introduction to `Pandas` objects**: Learn what `Pandas` Series, DataFrames and Indices are and what they are used for
- **Data selection in `Pandas`**: Idex rows, columns and individual items in a `Pandas` Series and DataFrame
- **Data analysis and manipulation in `Pandas`**: Perform advanced hierarchical indexing on your dataset, run simple descriptives on your dataset, basic handling of missing data, carry out aggregation and grouping


## `Pandas`

Pandas is a newer package built on top of `NumPy`, and provides an efficient implementation of a `DataFrame`, the core Pandas object. DataFrames are essentially multidimensional arrays with attached row and column labels, and often with heterogeneous types and/or missing data. As well as offering a convenient storage interface for labeled data, Pandas implements a number of powerful data operations familiar to users of both database frameworks and spreadsheet programs. We will use `Pandas` as the main tool to structure, manipulate and store data throughout this course. As such Pandas constitutes a core data science library that all of you should be very well familiar with.

Let's get started...

In [321]:
import pandas as pd

### Introduction to `Pandas` objects
At the very basic level, Pandas objects can be thought of as enhanced versions of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices. Pandas provides a host of useful tools, methods, and functionality on top of the basic data structures, but nearly everything that follows will require an understanding of what these structures are. Thus, before we go any further, let's introduce these three fundamental Pandas data structures: the Series, DataFrame, and Index.

#### The `Pandas Series` Object
A Pandas Series is a one-dimensional array of indexed data. It can be created from a list or array as follows:

In [322]:
# create a Series using pd.Series and assign it to variable A
A = pd.Series([12,13,14,15,16,17])
A

0    12
1    13
2    14
3    15
4    16
5    17
dtype: int64

In [323]:
# return the type of the created Series
type(A)

pandas.core.series.Series

As we see in the output, the Series wraps both a sequence of values and a sequence of indices, which we can access with the values and index attributes. The values are simply a familiar NumPy array:

In [324]:
# return the values of A using A.values
A.values

array([12, 13, 14, 15, 16, 17])

The index is an array-like object of type pd.Index, which we'll discuss in more detail later.

In [325]:
# return the indices of A using A.index
A.index

RangeIndex(start=0, stop=6, step=1)

From what we've seen so far, it may look like the Series object is basically interchangeable with a one-dimensional NumPy array. **The essential difference is the presence of the index**: while the Numpy Array has an implicitly defined integer index used to access the values, the Pandas Series has an explicitly defined index associated with the values.
This explicit index definition gives the Series object additional capabilities. For example, the index need not be an integer, but can consist of values of any desired type. For example, if we wish, we can use strings as an index:

In [326]:
# create a Series B and assign strings as index using the "index=[]"
B = pd.Series([0.25, 0.5, 0.75, 1.0],index=['a', 'b', 'c', 'd'])
B

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In this way, you can think of a Pandas Series a bit like a specialization of a Python dictionary. A dictionary is a structure that maps arbitrary keys to a set of arbitrary values, and a Series is a structure which maps typed keys to a set of typed values. This typing is important: just as the type-specific compiled code behind a NumPy array makes it more efficient than a Python list for certain operations, the type information of a Pandas Series makes it much more efficient than Python dictionaries for certain operations.
The Series-as-dictionary analogy can be made even more clear by constructing a Series object directly from a Python dictionary:

In [327]:
# note the following dictionary of state populations
population_dict = {'California': 38332521,
                   'Texas': 2644819,
                   'New York': 19651127,
                   'Florida': 19552860,
                   'Illinois': 12882135}

population_dict

{'California': 38332521,
 'Texas': 2644819,
 'New York': 19651127,
 'Florida': 19552860,
 'Illinois': 12882135}

In [328]:
# create a Series from population_dict
population_series = pd.Series(population_dict)

Unlike a dictionary, though, the Series also supports array-style operations such as slicing:

In [329]:
# returning a single element works both with dictionaries and Series
print(population_dict["California"])
print(population_series["California"])

38332521
38332521

In [330]:
# try to return the first three populations (California, Texas, New York) from population_dict
population_dict["California":"New York"]

TypeError: unhashable type: 'slice'

In [331]:
# try to return the first three populations (California, Texas, New York) from population_series
population_series["California":"New York"]

California    38332521
Texas          2644819
New York      19651127
dtype: int64

#### The `Pandas DataFrame` Object
The next fundamental structure in `Pandas`  is the `DataFrame` . Like the Series object discussed in the previous section, the DataFrame can be thought of either as a generalization of a NumPy array, or as a specialization of a Python dictionary. We'll now take a look at each of these perspectives.

If a Series is analogous to a one-dimensional array with flexible indices, a DataFrame is analogous to a two-dimensional array with both flexible row indices and flexible column names. Just as you might think of a two-dimensional array as an ordered sequence of aligned one-dimensional columns, you can think of a DataFrame as a sequence of aligned Series objects. Here, by "aligned" we mean that they share the same index.

In [332]:
# let's create a second series of state areas
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area_series = pd.Series(area_dict)
area_series

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64


Now that we have this along with the population Series from before, we can use a dictionary to construct a single two-dimensional object containing this information:

In [333]:
# create a Pandas Dataframe called states using pd.DataFrame
states = pd.DataFrame({'population': population_series,
                       'area': area_series})
states

            population    area
California    38332521  423967
Texas          2644819  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [334]:
# return the type of states
type(states)

pandas.core.frame.DataFrame

In [335]:
# return the values of states 
states.values

array([[38332521,   423967],
       [ 2644819,   695662],
       [19651127,   141297],
       [19552860,   170312],
       [12882135,   149995]])

Like the Series object, the DataFrame has an index attribute that gives access to the index labels:

In [336]:
# return the indices of states
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

Additionally, the DataFrame has a columns attribute, which is an Index object holding the column labels:

In [337]:
# return the column names of states using .columns
states.columns

Index(['population', 'area'], dtype='object')


Thus the DataFrame can be thought of as a generalization of a two-dimensional NumPy array, where both the rows and columns have a generalized index for accessing the data.

### The `Pandas Index` Object
We have seen here that both the Series and DataFrame objects contain an explicit index that lets you reference and modify data. This Index object is an interesting structure in itself, and it can be thought of either as an immutable array or as an ordered set (technically a multi-set, as Index objects may contain repeated values). Those views have some interesting consequences in the operations available on Index objects. As a simple example, let's construct an Index from a list of integers:

In [338]:
# create an Index object ind using pd.Index
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

The Index in many ways operates like an array. For example, we can use standard Python indexing notation to retrieve values or slices:

In [339]:
# return the first element of ind
ind[0]

2

In [340]:
# return every second object of ind
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

Index objects also have many of the attributes familiar from NumPy arrays:

In [341]:
# print the size, shape, number of dimensions and data type of ind
print(
    "Size:", ind.size,
    "\nShape:", ind.shape, 
    "\nNumber of dimensions:", ind.ndim, 
    "\nDatatype:", ind.dtype)

Size: 5
Shape: (5,)
Number of dimensions: 1
Datatype: int64

One difference between Index objects and NumPy arrays is that indices are immutable–that is, they cannot be modified via the normal means

In [342]:
# try to change the value of the first element of ind
ind[0] = 5

TypeError: Index does not support mutable operations

### Extracting values in `Pandas`

The terminology used below (e.g. extracting, selecting, slicing...) can be confusing sometimes. For a quick overview, refer to https://avichawla.substack.com/p/are-you-sure-you-are-using-the-correct for a nice, intuitive overview.

#### Extracting values from a Series

As we saw in the previous section, a Series object acts in many ways like a one-dimensional NumPy array, and in many ways like a standard Python dictionary. If we keep these two overlapping analogies in mind, it will help us to understand the patterns of data indexing and extraction in these arrays.

Like a dictionary, the Series object provides a mapping from a collection of keys (i.e. the index) to a collection of values:

In [343]:
# remember our Series B
B

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [344]:
# return the first element of B using an explicit index (as we are used to from Python dictionaries)
B["a"]

0.25

We can also use dictionary-like Python expressions and methods to examine the keys/indices and values:

In [345]:
# use the .keys() method to extract the indices of B
B.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [346]:
# use the .items() method to extract keys,value pairs
list(B.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

Series objects can even be modified with a dictionary-like syntax. Just as you can extend a dictionary by assigning to a new key, you can extend a Series by assigning to a new index value:

In [347]:
# add a new key,value pair to B
B['x'] = 100
B

a      0.25
b      0.50
c      0.75
d      1.00
x    100.00
dtype: float64

In [348]:
# change the value of the first element of B
B['a'] = 0
B

a      0.00
b      0.50
c      0.75
d      1.00
x    100.00
dtype: float64

A Series builds on this dictionary-like interface and provides array-style item extraction via the same basic mechanisms as NumPy arrays. Examples of these are as follows:

In [349]:
# return the first element of B using an implicit index (as we are used to from NumPy arrays)
B[0]

0.0

In [350]:
# slicing by explicit index: extract the first three elements of B
B['a':'c']

a    0.00
b    0.50
c    0.75
dtype: float64

In [351]:
# slicing by implicit index: extract the first three elements of B
B[0:3]

a    0.00
b    0.50
c    0.75
dtype: float64

In [352]:
# multiple explicit indexing: extract multiple elements using a list of indices
B[["a", "c", "x"]]

a      0.00
c      0.75
x    100.00
dtype: float64

Notice that when slicing with an explicit index (i.e., data['a':'c']), the final index is included in the slice, while when slicing with an implicit index (i.e., data[0:2]), the final index is excluded from the slice.

**Indexers: loc and iloc**

These slicing and indexing conventions can be a source of confusion. For example, if your Series has an explicit integer index, an indexing operation such as B[1] will use the explicit indices, while a slicing operation like B[1:3] will use the implicit Python-style index.

In [353]:
# let's create a new Series with explicit integer indices
C = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
C

1    a
3    b
5    c
dtype: object

In [354]:
# explicit index when extracting a single row
C[1]

'a'

In [355]:
# implicit index when slicing multiple rows
C[1:3]

3    b
5    c
dtype: object

Because of this potential confusion in the case of integer indexes, Pandas provides some special indexer attributes that explicitly expose certain indexing schemes. These are not functional methods, but attributes that expose a particular slicing interface to the data in the Series.
First, the `.loc` attribute allows indexing and slicing that always references the **explicit index**:

In [356]:
# extract the value "a" using .loc[]
C.loc[1]

'a'

In [357]:
# extract the values "a" and "b" using .loc[]
C.loc[1:3]

1    a
3    b
dtype: object

The `.iloc` attribute allows indexing and slicing that always references the **implicit Python-style index**:

In [358]:
# extract the value "a" using .iloc[]
C.iloc[0]

'a'

In [359]:
# extract the values "a" and "b" using .iloc[]
C.iloc[0:2]

1    a
3    b
dtype: object

One guiding principle of Python code is that **"explicit is better than implicit"**. The explicit nature of `.loc` and `.iloc` make them very useful in maintaining clean and readable code; especially in the case of integer indices, I recommend using these both to make code easier to read and understand, and to prevent subtle bugs due to the mixed indexing/slicing convention.

#### Extracting data from a DataFrame

Recall that a DataFrame acts in many ways like a two-dimensional or structured array, and in other ways like a dictionary of Series structures sharing the same index. These analogies can be helpful to keep in mind as we explore data extraction within this structure.

In [360]:
# remember our states DataFrame
states

            population    area
California    38332521  423967
Texas          2644819  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

The individual Series that make up the columns of the DataFrame can be selected via dictionary-style indexing of the column name:

In [361]:
# select the area column of states
states["area"]

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [362]:
# alternatively, you can also select a column by appending its name to the name of the DataFrame
states.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [363]:
# return the values of the area column
states["area"].values

array([423967, 695662, 141297, 170312, 149995])

Like with the Series objects discussed earlier, this dictionary-style syntax can also be used to modify the object, in this case adding a new column:

In [364]:
# let's add the population density to states
states["pop_density"] = states["population"] / states["area"]
states

            population    area  pop_density
California    38332521  423967    90.413926
Texas          2644819  695662     3.801874
New York      19651127  141297   139.076746
Florida       19552860  170312   114.806121
Illinois      12882135  149995    85.883763

In [365]:
# select the pop_density column from states
states["pop_density"]

California     90.413926
Texas           3.801874
New York      139.076746
Florida       114.806121
Illinois       85.883763
Name: pop_density, dtype: float64

As mentioned previously, we can also view the DataFrame as an enhanced two-dimensional array. We can examine the raw underlying data array using the values attribute:

In [366]:
# return the data of states using .values
states.values

array([[3.83325210e+07, 4.23967000e+05, 9.04139261e+01],
       [2.64481900e+06, 6.95662000e+05, 3.80187361e+00],
       [1.96511270e+07, 1.41297000e+05, 1.39076746e+02],
       [1.95528600e+07, 1.70312000e+05, 1.14806121e+02],
       [1.28821350e+07, 1.49995000e+05, 8.58837628e+01]])

With this picture in mind, many familiar array-like observations can be done on the DataFrame itself. For example, we can transpose the full DataFrame to swap rows and columns:

In [367]:
# transpose states using .T
states.T

,California,Texas,New York,Florida,Illinois
population,3.833252e+07,2.644819e+06,1.965113e+07,1.955286e+07,1.288214e+07
area,4.239670e+05,6.956620e+05,1.412970e+05,1.703120e+05,1.499950e+05
pop_density,9.041393e+01,3.801874e+00,1.390767e+02,1.148061e+02,8.588376e+01

When it comes to indexing of DataFrame objects, however, it is clear that the dictionary-style indexing of columns precludes our ability to simply treat it as a NumPy array. In particular, passing a single index to an array accesses a row:

In [368]:
# returns a row
states.values[0]

array([3.83325210e+07, 4.23967000e+05, 9.04139261e+01])

...and passing a single "index" to a DataFrame accesses a column:

In [369]:
# returns a column
states["area"]

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

The difference between NumPy arrays and DataFrames becomes evident also when attempting to access a single element. While you might remember from last week's workshop that we can access an element in a two-dimensional array as follows:

In [370]:
# returns the element in the first row and second column
states.values[0,1]

423967.0

...the same does not work for our DataFrame:

In [371]:
# results in an error message
states[0,1]

KeyError: (0, 1)

Thus for array-style indexing, we need another convention. Here Pandas again uses the `.loc` and `.iloc` indexers mentioned earlier. Using the `.iloc` indexer, we can index the underlying array as if it is a simple NumPy array (using the implicit Python-style index), but the DataFrame index and column labels are maintained in the result:

In [373]:
states

            population    area  pop_density
California    38332521  423967    90.413926
Texas          2644819  695662     3.801874
New York      19651127  141297   139.076746
Florida       19552860  170312   114.806121
Illinois      12882135  149995    85.883763

In [374]:
# return the first three rows and first two columns of states using iloc (implicit indices)
states.iloc[:3, :2]

            population    area
California    38332521  423967
Texas          2644819  695662
New York      19651127  141297

Similarly, using the `.loc` indexer we can index the underlying data in an array-like style but using the explicit index and column names:

In [375]:
# return the first three rows and first two columns of states using loc (explicit indices)
states.loc[:"New York", :"area"]

            population    area
California    38332521  423967
Texas          2644819  695662
New York      19651127  141297

We can also pass conditions to the indexer, a technique called **masking**.

In [376]:
# masking with .loc: return the states with pop_density > 100
states.loc[states.pop_density > 100]

          population    area  pop_density
New York    19651127  141297   139.076746
Florida     19552860  170312   114.806121

In [377]:
# you can define multiple conditions as follows
(states["area"] > 150000) & (states["pop_density"] > 50)

California     True
Texas         False
New York      False
Florida        True
Illinois      False
dtype: bool

In [378]:
# masking with explicit column index
states[(states["area"] > 150000) & (states["pop_density"] > 50)]

            population    area  pop_density
California    38332521  423967    90.413926
Florida       19552860  170312   114.806121

### **Exercise**: Produce a DF of states with population >15M and <30M. Name this DF `mid_sized_states_df`.

In [379]:
states

            population    area  pop_density
California    38332521  423967    90.413926
Texas          2644819  695662     3.801874
New York      19651127  141297   139.076746
Florida       19552860  170312   114.806121
Illinois      12882135  149995    85.883763

In [380]:
# Your code here
mid_sized_states_df = states[(states["population"] > 15000000) & (states["population"] < 30000000)]

In [381]:
mid_sized_states_df

          population    area  pop_density
New York    19651127  141297   139.076746
Florida     19552860  170312   114.806121

Any of these indexing conventions may also be used to set or modify values; this is done in the standard way that you might be accustomed to from working with NumPy:

In [382]:
# change the population density of California to 100
states.loc["California","pop_density"] = 100
states

            population    area  pop_density
California    38332521  423967   100.000000
Texas          2644819  695662     3.801874
New York      19651127  141297   139.076746
Florida       19552860  170312   114.806121
Illinois      12882135  149995    85.883763

### **Excercise**: Set the population of Florida to 19M

In [1]:
# Your code here
states.loc["Florida","population"] = 19000000

NameError: name 'states' is not defined

In [384]:
states

            population    area  pop_density
California    38332521  423967   100.000000
Texas          2644819  695662     3.801874
New York      19651127  141297   139.076746
Florida       19000000  170312   114.806121
Illinois      12882135  149995    85.883763

Look at the following line of code, where we try to add a column to our mid_sized_states_df:

In [385]:
mid_sized_states_df["area_x10"] = mid_sized_states_df["area"]*10

/var/folders/w2/qvkw67fs4gz183wq08fkfbx80000gp/T/ipykernel_81676/4108304400.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  mid_sized_states_df["area_x10"] = mid_sized_states_df["area"]*10

The above error is something you will encounter when working with pandas Dataframes. It is intended to give you a warning that the behavior that you will get executing this code is not always what you expect. It comes from the definition of mid_sized_states_df.

Pandas is unsure whether you wanted to add values to the 'states' dataframe or the 'mid_sized_states_df' dataframe!
To get rid of this error, you can explicitly copy the dataframe so pandas knows we are trying to add a column to the 'new' dataframe 'mid_sized_states_df'.

In [386]:
mid_sized_states_df = states[(states["population"] > 15000000) & (states["population"] < 30000000)].copy()
mid_sized_states_df["area_x10"] = mid_sized_states_df["area"]*10

In [387]:
mid_sized_states_df

          population    area  pop_density  area_x10
New York    19651127  141297   139.076746   1412970
Florida     19000000  170312   114.806121   1703120

### Data analysis and manipulation in `Pandas`

#### Hierarchical Indexing

**Using MultiIndex to create hierarchichal DataFrames**

Often it is useful to store higher-dimensional data, i.e. data indexed by more than one or two keys. The most appropriate Pandas function for this is `MultiIndex`. We will demonstrate using a simple example:

In [388]:
# We use a 2-D example, first specifying the outer and inner dimension as well as the values
Outer = ['California','California',
         'New York','New York',
         'Texas','Texas']

Inner = [2000,2010,
         2000,2010,
         2000,2010]

populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]

# From the outer and inner dimensions we create an index

index_list = list(zip(Outer,Inner))
index_list

[('California', 2000),
 ('California', 2010),
 ('New York', 2000),
 ('New York', 2010),
 ('Texas', 2000),
 ('Texas', 2010)]

In [389]:
# from index_list we can create a multi index
index_object = pd.MultiIndex.from_tuples(index_list)
index_object

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [390]:
# finally, we create a data frame with hierarchichal indices

df = pd.DataFrame(index=index_object,
                  data=populations,
                  columns=["Population"])

df

                 Population
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [391]:
# let's add more columns to df
area = [164,164, #California 
        55,55,   #NY State
        269,269] #Texas

df["Area"] = area
df["Density"] = df["Population"]/df["Area"]
df

                 Population  Area        Density
California 2000    33871648   164  206534.439024
           2010    37253956   164  227158.268293
New York   2000    18976457    55  345026.490909
           2010    19378102    55  352329.127273
Texas      2000    20851820   269   77516.059480
           2010    25145561   269   93477.921933

In [392]:
# again, we can easily transpose this DataFrame
df.transpose()

              California                    New York                \
                    2000          2010          2000          2010
Population  3.387165e+07  3.725396e+07  1.897646e+07  1.937810e+07
Area        1.640000e+02  1.640000e+02  5.500000e+01  5.500000e+01
Density     2.065344e+05  2.271583e+05  3.450265e+05  3.523291e+05

                   Texas
                    2000          2010
Population  2.085182e+07  2.514556e+07
Area        2.690000e+02  2.690000e+02
Density     7.751606e+04  9.347792e+04

**MultiIndex as extra dimension**

You might notice that we could have stored the same data using a simple DataFrame with index and column labels. The `unstack()` method let's us convert a hierachically indexed Series into a conventionally indexed DataFrame

In [393]:
df['Population'].unstack()

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

#### Quick data analysis in `Pandas`

In practice your dataset will often be considerably larger than the illustrative example above. In these cases it is often useful to run brief descriptive statistical analyses on the set, which will help to get a first feel for the data. 

We will demonstrate how to do this using the provided `iris.csv` dataset. This is a famous dataset used frequently for educational purposes in data science. You can read up on the dataset, its content and its origins here: https://en.wikipedia.org/wiki/Iris_flower_data_set.

The iris dataset contains measurements for 150 iris flowers from three different species.

The __three classes__ in the Iris dataset:
* Iris-setosa (n=50)
* Iris-versicolor (n=50)
* Iris-virginica (n=50)

The __four features__ of the Iris dataset:
* sepal length in cm
* sepal width in cm
* petal length in cm
* petal width in cm

![Iris dataset explained (Source: apsl.net)](iris.original.png)

In [394]:
# first read in the dataset as a DataFrame
# for the indirect reference "iris.csv" to work make sure it is contained in the same folder as your notebook
# You can set the index by using the index_col function
iris_set = pd.read_csv("iris.csv", sep=",", index_col="number")

In [395]:
# examine the first 5 rows using .head()
iris_set.head()

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
number
1                5.1          3.5           1.4          0.2  setosa
2                4.9          3.0           1.4          0.2  setosa
3                4.7          3.2           1.3          0.2  setosa
4                4.6          3.1           1.5          0.2  setosa
5                5.0          3.6           1.4          0.2  setosa

In [396]:
# return all column names using .columns
iris_set.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [397]:
# the .describe()-function provides an overview of key descriptive statistics
iris_set.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    148.000000   149.000000    149.000000   150.000000
mean       5.827703     3.055705      3.753020     1.199333
std        0.818479     0.436878      1.770195     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.300000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [398]:
# the .info()-function provides an overview of null values and datatypes per column
iris_set.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  148 non-null    float64
 1   Sepal.Width   149 non-null    float64
 2   Petal.Length  149 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [399]:
# you can also focus your analysis on individual features by indexing them
iris_set["Sepal.Width"].describe()

count    149.000000
mean       3.055705
std        0.436878
min        2.000000
25%        2.800000
50%        3.000000
75%        3.300000
max        4.400000
Name: Sepal.Width, dtype: float64

In [400]:
# additionally you can call the functions seperately, e.g. .count()
iris_set.count()

Sepal.Length    148
Sepal.Width     149
Petal.Length    149
Petal.Width     150
Species         150
dtype: int64

#### Handling missing numerical data (`NaN` values)
If you have paid attention to the descriptive statistics above you will have noticed that the __count__ of values differs across features. This is a first indication for missing numerical data. In the real world you will often encounter incomplete and noisy data which will require pre-processing before you can apply data science and machine learning tools to them. In this section we will provide a quick overview on how to deal with missing data in your data sets. 
Note that Python has two ways of highlighting missing data:
* `NaN` - (acronym for Not a Number), is a special floating-point value recognized by all systems that use the standard IEEE floating-point representation
* `None` - Python-specific object that is often used for missing data in Python code. Because it is a Python object, `None` can only be used in arrays with data type 'object' (i.e., arrays of Python objects)

**Detecting missing numerical data**

Pandas data structures have two useful methods for detecting null data: `isnull()` and `notnull()`. Either one will return a Boolean mask over the data.

In [401]:
# .isnull() returns "True" for every missing numerical value in the dataset
iris_set.isnull()

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
number
1              False        False         False        False    False
2              False        False         False        False    False
3              False        False         False        False    False
4              False        False         False        False    False
5              False        False         False        False    False
...              ...          ...           ...          ...      ...
146            False        False         False        False    False
147            False        False         False        False    False
148            False        False         False        False    False
149            False        False         False        False    False
150            False        False         False        False    False

[150 rows x 5 columns]

In [402]:
# .notnull() returns "False" for every missing numerical value in the dataset
iris_set.notnull()

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
number
1               True         True          True         True     True
2               True         True          True         True     True
3               True         True          True         True     True
4               True         True          True         True     True
5               True         True          True         True     True
...              ...          ...           ...          ...      ...
146             True         True          True         True     True
147             True         True          True         True     True
148             True         True          True         True     True
149             True         True          True         True     True
150             True         True          True         True     True

[150 rows x 5 columns]

#### Dealing with missing numerical data
In essence two approaches to dealing with missing data exist:
* __Elimination__: Dropping null values from the dataset
* __Imputation__: Imputing/replacing null values with numerical values/estimates

**Elimination (i.e. dropping null values)**

We cannot drop single values from a data frame; we can only drop full rows or full columns. Depending on the application, you might want one or the other, so `dropna()` gives a number of options:

We use the `dropna(axis=0)` function to drop all rows from the dataset that include null values. Note that `dropna()` will not modify your dataframe unless you call `dropna(axis=0,inplace=True)`.

In [403]:
# let's drop all rows that include null values but not modify the dataframe
iris_set.dropna(axis=0, inplace=False)

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
number
1                5.1          3.5           1.4          0.2     setosa
2                4.9          3.0           1.4          0.2     setosa
3                4.7          3.2           1.3          0.2     setosa
4                4.6          3.1           1.5          0.2     setosa
5                5.0          3.6           1.4          0.2     setosa
...              ...          ...           ...          ...        ...
146              6.7          3.0           5.2          2.3  virginica
147              6.3          2.5           5.0          1.9  virginica
148              6.5          3.0           5.2          2.0  virginica
149              6.2          3.4           5.4          2.3  virginica
150              5.9          3.0           5.1          1.8  virginica

[146 rows x 5 columns]

We use the `dropna(axis=1)` function to drop all columns from the dataset that incl. null values. Note that, also in this case, `dropna()` will not modify your dataframe unless you call `dropna(axis=1,inplace=True)`

In [404]:
# let's drop all columns that include null values but not modify the dataframe
iris_set.dropna(axis=1, inplace=False)

        Petal.Width    Species
number
1               0.2     setosa
2               0.2     setosa
3               0.2     setosa
4               0.2     setosa
5               0.2     setosa
...             ...        ...
146             2.3  virginica
147             1.9  virginica
148             2.0  virginica
149             2.3  virginica
150             1.8  virginica

[150 rows x 2 columns]

In [405]:
# note that our dataframe has not been modified, i.e. we still have all 150 rows and 5 columns
iris_set.shape

(150, 5)

In [406]:
# we can therefore also use dropna() to easily identify the number of rows with missing values 
len(iris_set)-len(iris_set.dropna())

4

In [407]:
# If you whish to clean the data with dropna it is good practice to define a new data frame
iris_set_clean = iris_set.dropna(axis=0)

In [408]:
# compare the number of rows of our original and clean dataframes
print("iris_set:",len(iris_set))
print("iris_set_clean:",len(iris_set_clean))

iris_set: 150
iris_set_clean: 146

### **Exercise**: Use the technique of **masking** to display all records with NaN values for Sepal.Length.

In [409]:
# Your code here
iris_set[iris_set["Sepal.Length"].isnull() == True]

        Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
number
123              NaN          2.8           6.7          2.0  virginica
124              NaN          2.7           4.9          1.8  virginica

**Imputation (i.e. filling null values)**

Imputation fills null values with numerical values chosen by the data scientist. For this, `fillna()`provides the appropriate tools.

The data scientist will usually choose one of the following methods:
* Fill with zeros: `fillna(0)`
* Conduct a forward fill (i.e. filling NaN values with data from previous observation): `fillna(method="ffill")`
* Conduct a backward fill (i.e. filling NaN values with data from following observation): `fillna(method="bfill")`
* Fill with the column mean,max,min, etc.: `df["Col_name"].fillna(value=df["Col_name"].mean())`
* Custom fill depending on the application

In [410]:
# let's replace the NaN values in Sepal.Length with the average sepal length; modify the dataframe by setting "inplace = True"
iris_set["Sepal.Length"].fillna(value=iris_set["Sepal.Length"].mean(), inplace=True)

In [411]:
# check out the new values of the 123rd and 124th flower
print(iris_set.loc[123,"Sepal.Length"])
print(iris_set.loc[124,"Sepal.Length"])

5.827702702702703
5.827702702702703

#### Data aggregation and grouping
The `groupby()` method allows for grouping of rows and the application of aggregation functions to these grouped rows. It is a highly useful method in data science and used extensively. We will return to the iris dataset for illustration purposes.

In [412]:
# let's get some summary statistics for the different species (setosa, versicolor, virginica), e.g. the mean of our four features
species_groups_mean = iris_set.groupby("Species").mean()

In [413]:
species_groups_mean

            Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Species
setosa          5.006000     3.430612      1.462000        0.246
versicolor      5.936000     2.770000      4.255102        1.326
virginica       6.541108     2.974000      5.552000        2.026

In [414]:
# you can also use other aggregation routines, including .sum(), .max(), .min(), .count()
species_groups_min = iris_set.groupby("Species").min()

In [415]:
species_groups_min

            Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Species
setosa               4.3          2.3           1.0          0.1
versicolor           4.9          2.0           3.0          1.0
virginica            4.9          2.2           4.5          1.4

In [416]:
# Try out some more aggregation routines on the sample here:

In [417]:
# we can also apply multiple aggregation routines at the same time using .agg()
species_groups_agg = iris_set.groupby("Species").agg(['mean', 'max', 'count'])
species_groups_agg

           Sepal.Length            Sepal.Width            Petal.Length       \
                   mean  max count        mean  max count         mean  max
Species
setosa         5.006000  5.8    50    3.430612  4.4    49     1.462000  1.9
versicolor     5.936000  7.0    50    2.770000  3.4    50     4.255102  5.1
virginica      6.541108  7.9    50    2.974000  3.8    50     5.552000  6.9

                 Petal.Width
           count        mean  max count
Species
setosa        50       0.246  0.6    50
versicolor    49       1.326  1.8    50
virginica     50       2.026  2.5    50

Finally you can also profide custom aggregation routines, which is useful if features follow different aggregation routines. As an illustrative (albeit not very realistic example) we will implement the following aggregation rules:

- Sepal.Length: `max()`
- Sepal.Width: `mean()`
- Petal.Length: `min()`
- Petal.Width: `mean()`

Custom aggregation is, again, implemented using the `.agg()` command.

In [418]:
# first, define a dictionary that maps features to aggreagation routines
agg_dict = {'Sepal.Length':"max", 'Sepal.Width':"mean", 'Petal.Length':"min", 'Petal.Width':"mean"}

In [419]:
# second, pass the dictionary as an argument to .agg()
species_groups_custom = iris_set.groupby("Species").agg(agg_dict)

In [420]:
species_groups_custom

            Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Species
setosa               5.8     3.430612           1.0        0.246
versicolor           7.0     2.770000           3.0        1.326
virginica            7.9     2.974000           4.5        2.026

This brings us to the end of `Workshop_03`. Next week we will cover visualization techniques using `Matplotlib`.

---